###################################################################

# Created by write_sdc on Fri Nov 29 11:13:44 2024

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_wire_load_mode segmented
create_clock [get_ports CLK_I]  -name my_clock  -period 20  -waveform {0 10}
set_input_delay -clock my_clock  2  [get_ports RST_I]
set_input_delay -clock my_clock  2  [get_ports NRESET]
set_input_delay -clock my_clock  2  [get_ports ADR_I_4]
set_input_delay -clock my_clock  2  [get_ports ADR_I_3]
set_input_delay -clock my_clock  2  [get_ports ADR_I_2]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_31]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_30]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_29]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_28]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_27]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_26]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_25]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_24]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_23]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_22]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_21]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_20]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_19]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_18]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_17]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_16]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_15]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_14]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_13]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_12]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_11]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_10]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_9]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_8]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_7]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_6]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_5]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_4]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_3]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_2]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_1]
set_input_delay -clock my_clock  2  [get_ports SDAT_I_0]
set_input_delay -clock my_clock  2  [get_ports SEL_I_3]
set_input_delay -clock my_clock  2  [get_ports SEL_I_2]
set_input_delay -clock my_clock  2  [get_ports SEL_I_1]
set_input_delay -clock my_clock  2  [get_ports SEL_I_0]
set_input_delay -clock my_clock  2  [get_ports WE_I]
set_input_delay -clock my_clock  2  [get_ports STB_I]
set_input_delay -clock my_clock  2  [get_ports CYC_I]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_31]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_30]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_29]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_28]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_27]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_26]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_25]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_24]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_23]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_22]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_21]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_20]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_19]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_18]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_17]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_16]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_15]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_14]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_13]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_12]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_11]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_10]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_9]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_8]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_7]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_6]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_5]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_4]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_3]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_2]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_1]
set_input_delay -clock my_clock  2  [get_ports MDAT_I_0]
set_input_delay -clock my_clock  2  [get_ports ACK_I]
set_input_delay -clock my_clock  2  [get_ports ERR_I]
set_input_delay -clock my_clock  2  [get_ports PCLK]
set_output_delay -clock my_clock  2  [get_ports INTA_O]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_31]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_30]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_29]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_28]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_27]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_26]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_25]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_24]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_23]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_22]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_21]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_20]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_19]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_18]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_17]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_16]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_15]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_14]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_13]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_12]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_11]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_10]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_9]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_8]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_7]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_6]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_5]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_4]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_3]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_2]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_1]
set_output_delay -clock my_clock  2  [get_ports SDAT_O_0]
set_output_delay -clock my_clock  2  [get_ports ACK_O]
set_output_delay -clock my_clock  2  [get_ports ERR_O]
set_output_delay -clock my_clock  2  [get_ports ADR_O_31]
set_output_delay -clock my_clock  2  [get_ports ADR_O_30]
set_output_delay -clock my_clock  2  [get_ports ADR_O_29]
set_output_delay -clock my_clock  2  [get_ports ADR_O_28]
set_output_delay -clock my_clock  2  [get_ports ADR_O_27]
set_output_delay -clock my_clock  2  [get_ports ADR_O_26]
set_output_delay -clock my_clock  2  [get_ports ADR_O_25]
set_output_delay -clock my_clock  2  [get_ports ADR_O_24]
set_output_delay -clock my_clock  2  [get_ports ADR_O_23]
set_output_delay -clock my_clock  2  [get_ports ADR_O_22]
set_output_delay -clock my_clock  2  [get_ports ADR_O_21]
set_output_delay -clock my_clock  2  [get_ports ADR_O_20]
set_output_delay -clock my_clock  2  [get_ports ADR_O_19]
set_output_delay -clock my_clock  2  [get_ports ADR_O_18]
set_output_delay -clock my_clock  2  [get_ports ADR_O_17]
set_output_delay -clock my_clock  2  [get_ports ADR_O_16]
set_output_delay -clock my_clock  2  [get_ports ADR_O_15]
set_output_delay -clock my_clock  2  [get_ports ADR_O_14]
set_output_delay -clock my_clock  2  [get_ports ADR_O_13]
set_output_delay -clock my_clock  2  [get_ports ADR_O_12]
set_output_delay -clock my_clock  2  [get_ports ADR_O_11]
set_output_delay -clock my_clock  2  [get_ports ADR_O_10]
set_output_delay -clock my_clock  2  [get_ports ADR_O_9]
set_output_delay -clock my_clock  2  [get_ports ADR_O_8]
set_output_delay -clock my_clock  2  [get_ports ADR_O_7]
set_output_delay -clock my_clock  2  [get_ports ADR_O_6]
set_output_delay -clock my_clock  2  [get_ports ADR_O_5]
set_output_delay -clock my_clock  2  [get_ports ADR_O_4]
set_output_delay -clock my_clock  2  [get_ports ADR_O_3]
set_output_delay -clock my_clock  2  [get_ports ADR_O_2]
set_output_delay -clock my_clock  2  [get_ports SEL_O_3]
set_output_delay -clock my_clock  2  [get_ports SEL_O_2]
set_output_delay -clock my_clock  2  [get_ports SEL_O_1]
set_output_delay -clock my_clock  2  [get_ports SEL_O_0]
set_output_delay -clock my_clock  2  [get_ports WE_O]
set_output_delay -clock my_clock  2  [get_ports STB_O]
set_output_delay -clock my_clock  2  [get_ports CYC_O]
set_output_delay -clock my_clock  2  [get_ports CAB_O]
set_output_delay -clock my_clock  2  [get_ports HSYNC]
set_output_delay -clock my_clock  2  [get_ports VSYNC]
set_output_delay -clock my_clock  2  [get_ports CSYNC]
set_output_delay -clock my_clock  2  [get_ports BLANK]
set_output_delay -clock my_clock  2  [get_ports R_7]
set_output_delay -clock my_clock  2  [get_ports R_6]
set_output_delay -clock my_clock  2  [get_ports R_5]
set_output_delay -clock my_clock  2  [get_ports R_4]
set_output_delay -clock my_clock  2  [get_ports R_3]
set_output_delay -clock my_clock  2  [get_ports R_2]
set_output_delay -clock my_clock  2  [get_ports R_1]
set_output_delay -clock my_clock  2  [get_ports R_0]
set_output_delay -clock my_clock  2  [get_ports G_7]
set_output_delay -clock my_clock  2  [get_ports G_6]
set_output_delay -clock my_clock  2  [get_ports G_5]
set_output_delay -clock my_clock  2  [get_ports G_4]
set_output_delay -clock my_clock  2  [get_ports G_3]
set_output_delay -clock my_clock  2  [get_ports G_2]
set_output_delay -clock my_clock  2  [get_ports G_1]
set_output_delay -clock my_clock  2  [get_ports G_0]
set_output_delay -clock my_clock  2  [get_ports B_7]
set_output_delay -clock my_clock  2  [get_ports B_6]
set_output_delay -clock my_clock  2  [get_ports B_5]
set_output_delay -clock my_clock  2  [get_ports B_4]
set_output_delay -clock my_clock  2  [get_ports B_3]
set_output_delay -clock my_clock  2  [get_ports B_2]
set_output_delay -clock my_clock  2  [get_ports B_1]
set_output_delay -clock my_clock  2  [get_ports B_0]
set_clock_uncertainty 0  [get_ports CLK_I]
