###############################################################
#  Generated by:      Cadence Encounter 13.13-s017_1
#  OS:                Linux x86_64(Host ID 24p105-03)
#  Generated on:      Fri Nov 29 11:07:00 2024
#  Design:            VGA
#  Command:           saveDesign ./PAD_VGA.preroute.enc
###############################################################
current_design VGA
create_clock [get_ports {CLK_I}]  -name my_clock -period 20.000000 -waveform {0.000000 10.000000}
set_propagated_clock  [get_ports {CLK_I}]
set_wire_load_mode enclosed
set_input_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {STB_I}]
set_input_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {ACK_I}]
set_input_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {CYC_I}]
set_input_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {PCLK}]
set_input_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {ERR_I}]
set_input_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {WE_I}]
set_input_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {RST_I}]
set_input_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {NRESET}]
set_output_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {HSYNC}]
set_output_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {CSYNC}]
set_output_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {VSYNC}]
set_output_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {STB_O}]
set_output_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {CYC_O}]
set_output_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {ACK_O}]
set_output_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {ERR_O}]
set_output_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {BLANK}]
set_output_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {CAB_O}]
set_output_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {WE_O}]
set_output_delay -add_delay 2 -clock [get_clocks {my_clock}] [get_ports {INTA_O}]
set_clock_uncertainty  0 [get_ports {CLK_I}]
